{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "dbb8f4da",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n",
      "[notice] A new release of pip is available: 25.0.1 -> 25.1.1\n",
      "[notice] To update, run: python.exe -m pip install --upgrade pip\n"
     ]
    }
   ],
   "source": [
    "%pip install --upgrade --quiet langchain langchain-community langchain-openai langchain-ollama langchain-experimental neo4j langchain-neo4j neo4j-graphrag"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "0098ff4b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_core.runnables import (\n",
    "    RunnablePassthrough\n",
    ")\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from pydantic import BaseModel, Field\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "import os\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_ollama import ChatOllama\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "from neo4j import GraphDatabase\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings\n",
    "from langchain_community.document_loaders import TextLoader\n",
    "from langchain_community.vectorstores.neo4j_vector import remove_lucene_chars\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c001ebea",
   "metadata": {},
   "outputs": [],
   "source": [
    "AUTH = (\"neo4j\", os.getenv(\"NEO4J_PASSWORD\"))\n",
    "\n",
    "# Connect to Neo4j database\n",
    "driver = GraphDatabase.driver('bolt://192.168.137.121:7687', auth=AUTH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "000b723c",
   "metadata": {},
   "outputs": [],
   "source": [
    "loader = TextLoader(file_path=\"texts/books/barrie/peterpan.txt\", encoding=\"utf-8\")\n",
    "docs = loader.load()\n",
    "\n",
    "text_splitter = RecursiveCharacterTextSplitter(chunk_size=400, chunk_overlap=25)\n",
    "documents = text_splitter.split_documents(documents=docs)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "66574e4d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Document(metadata={'source': 'texts/books/barrie/peterpan.txt', 'id': 'cec59315c68e80292ae497dd5967100b'}, page_content='\\ufeff\\nPeter Pan\\n\\n[PETER AND WENDY]\\n\\nby J. M. Barrie [James Matthew Barrie]\\n\\nA Millennium Fulcrum Edition produced in 1991 by Duncan Research. Note\\nthat while a copyright was initially claimed for the labor involved in\\ndigitization, that copyright claim is not consistent with current\\ncopyright requirements. This text, which matches the 1911 original\\npublication, is in the public domain in the US.')"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "documents[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "9cacd064",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm_type = \"ollama\"\n",
    "llm = ChatOllama(model=\"gemma3:1b\", temperature=0, base_url=os.getenv(\"OLLAMA_HOST\"))\n",
    "llm_transformer = LLMGraphTransformer(llm=llm, relationship_properties=True)\n",
    "\n",
    "graph_documents = await llm_transformer.aconvert_to_graph_documents(documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "bb2b7323",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "GraphDocument(nodes=[Node(id='Peter', type='Person', properties={}), Node(id='Wendy', type='Person', properties={}), Node(id='James Matthew Barre', type='Author', properties={}), Node(id='Millennium Fulcrum', type='Edition', properties={}), Node(id='1991', type='Date', properties={}), Node(id='Duncan Research', type='Publisher', properties={}), Node(id='1911', type='Year', properties={}), Node(id='Public Domain', type='Status', properties={})], relationships=[Relationship(source=Node(id='Peter', type='Person', properties={}), target=Node(id='Wendy', type='Person', properties={}), type='RELATIONSHIP', properties={}), Relationship(source=Node(id='James Matthew Barre', type='Author', properties={}), target=Node(id='Peter', type='Person', properties={}), type='RELATIONSHIP', properties={}), Relationship(source=Node(id='James Matthew Barre', type='Author', properties={}), target=Node(id='Millennium Fulcrum', type='Edition', properties={}), type='RELATIONSHIP', properties={}), Relationship(source=Node(id='Millennium Fulcrum', type='Edition', properties={}), target=Node(id='1991', type='Date', properties={}), type='DATE', properties={})], source=Document(metadata={'source': 'texts/books/barrie/peterpan.txt', 'id': 'cec59315c68e80292ae497dd5967100b'}, page_content='\\ufeff\\nPeter Pan\\n\\n[PETER AND WENDY]\\n\\nby J. M. Barrie [James Matthew Barrie]\\n\\nA Millennium Fulcrum Edition produced in 1991 by Duncan Research. Note\\nthat while a copyright was initially claimed for the labor involved in\\ndigitization, that copyright claim is not consistent with current\\ncopyright requirements. This text, which matches the 1911 original\\npublication, is in the public domain in the US.'))"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_documents[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "d3b9600b",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph('bolt://192.168.137.117:7687', username='neo4j', password=os.getenv(\"NEO4J_PASSWORD\"), database='neo4j')\n",
    "graph.add_graph_documents(\n",
    "    graph_documents,\n",
    "    baseEntityLabel=True,\n",
    "    include_source=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "b484ff15",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'bolt://192.168.137.117:7687'"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "os.getenv('NEO4J_URL')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "fc5a5e55",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\jeff\\AppData\\Local\\Temp\\ipykernel_19468\\2318862285.py:3: LangChainDeprecationWarning: The class `Neo4jVector` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-neo4j package and should be used instead. To use it run `pip install -U :class:`~langchain-neo4j` and import as `from :class:`~langchain_neo4j import Neo4jVector``.\n",
      "  vector_store = Neo4jVector(\n"
     ]
    }
   ],
   "source": [
    "from langchain_ollama import OllamaEmbeddings\n",
    "\n",
    "vector_store = Neo4jVector(\n",
    "    embedding=OllamaEmbeddings(model=\"nomic-embed-text\"),\n",
    "    url=os.getenv('NEO4J_URL'),\n",
    "    username='neo4j',\n",
    "    password=os.getenv(\"NEO4J_PASSWORD\"),\n",
    "    database='neo4j'\n",
    ")\n",
    "vector_index = vector_store.from_existing_graph(\n",
    "    embedding=OllamaEmbeddings(model=\"nomic-embed-text\"),\n",
    "    search_type=\"hybrid\",\n",
    "    node_label=\"Document\",\n",
    "    text_node_properties=[\"text\"],\n",
    "    embedding_node_property=\"embedding\",\n",
    ")\n",
    "vector_retriever = vector_index.as_retriever()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "6612bb57",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Entities(BaseModel):\n",
    "    names: list[str] = Field(\n",
    "        ...,\n",
    "        description=\"All the person, organization, or business entities that appear in the text\",\n",
    "    )\n",
    "\n",
    "prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            \"You are extracting organization and person entities from the text.\",\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            \"Use the given format to extract information from the following input: {question}\",\n",
    "        )\n",
    "    ]\n",
    ")\n",
    "\n",
    "entity_chain = prompt | llm.with_structured_output(Entities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "76d8b023",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Peter', 'Wendy']"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "entity_chain.invoke({\"question\": \"Who are Peter and Wendy?\"}).names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "cf7d3bc2",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_full_text_query(input: str) -> str:\n",
    "    words = [el for el in remove_lucene_chars(input).split() if el]\n",
    "    if not words:\n",
    "        return \"\"\n",
    "    full_text_query = \" AND \".join([f\"{word}~2\" for word in words])\n",
    "    print(f\"Generated Query: {full_text_query}\")\n",
    "    return full_text_query.strip()\n",
    "\n",
    "def graph_retriever(question: str) -> str:\n",
    "    \"\"\"\n",
    "    Collects the neighborhood of entities mentioned in the question\n",
    "    \"\"\"\n",
    "    result = \"\"\n",
    "    entities = entity_chain.invoke({\"question\": question})\n",
    "    for entity in entities.names:\n",
    "        response = graph.query(\n",
    "            \"\"\"CALL db.index.fulltext.queryNodes('entities', $query, {limit:2})\n",
    "            YIELD node,score\n",
    "            CALL {\n",
    "              WITH node\n",
    "              MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
    "              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\n",
    "              UNION ALL\n",
    "              WITH node\n",
    "              MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
    "              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +node.id AS output\n",
    "              }\n",
    "              RETURN output LIMIT 50\n",
    "              \"\"\",\n",
    "              {\"query\": generate_full_text_query(entity)},\n",
    "        )\n",
    "        result += \"\\n\".join([el['output'] for el in response])\n",
    "        return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "2bfe1bc9",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 13, offset: 106} for query: \"CALL db.index.fulltext.queryNodes('entities', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION ALL\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +node.id AS output\\n              }\\n              RETURN output LIMIT 50\\n              \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Query: Johnathan~2\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(graph_retriever(\"Who is Johnathan?\"))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
